# CreateAggregateAttribute Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IFCAnyHandle..::..CreateAggregateAttribute Method
IFCAnyHandle Class See Also
---
Creates an attribute that is an aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCAggregate CreateAggregateAttribute(
	string name
)
```

Visual Basic
---
```text
Public Function CreateAggregateAttribute ( _
	name As String _
) As IFCAggregate
```

Visual C++
---
```text
public:
IFCAggregate^ CreateAggregateAttribute(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The attribute name.
# ### Return Value
The aggregate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace